//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2011, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	OemWakeupEvent.uni
//
// Description:	Wake Up Event Setup description.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
//
// Wake Up Event Setup
//
#include "VFR.uni"
#langdef   x-UEFI-AMI "x-UEFI-AMI"    // AMI Mapping Language

#string STR_NULL_STRING                    #language eng ""
                                           #language zh-chs  ""
#string STR_BOOT_TO_SETUP                  #language eng "Boot To BIOS Setup"
                                           #language zh-chs "启动至BIOS Setup"
                                           #language x-UEFI-AMI  "BootToBIOSSetup"
#string STR_BOOT_TO_SETUP_HELP             #language eng "Enable Boot To BIOS Setup function for DEBUG"
                                           #language zh-chs "下次启动自动进入 Setup"
#string STR_SETUP                          #language eng "Force Setup"
                                           #language zh-chs "强制至Setup"
#string STR_AUTO                           #language eng "Auto"
                                           #language zh-chs "自动"
//<LiuYB018-20170526 Sync Setup with Intel project +>
#string STR_PLATFORM_INFORMATION                    #language eng "Platform Information"
                                                    #language zh-chs "平台信息"
#string STR_PLATFORM_STRING                         #language eng "Platform"
                                                    #language zh-chs "硬件平台"
#string STR_PLATFORM_STRING_VALUE                   #language eng "H620-G30"
                                                    #language zh-chs "H620-G30"
//<huangjin-20200103 Show Hygon PI version in setup +>
//#string STR_PLATFORM_AGESA_STRING                 #language eng "Agesa PI Version"
//                                                  #language zh-chs "Agesa 版本"
#string STR_PLATFORM_AGESA_STRING                   #language eng "Dhyana PI Version"
                                                    #language zh-chs "Dhyana PI 版本"
//<huangjin-20200103 Show Hygon PI version in setup ->
#string STR_PLATFORM_AGESA_STRING_VALUE             #language eng "1.0.1.1"
                                                    #language zh-chs "1.0.1.1"
//<LiuYB018-20170526 Sync Setup with Intel project ->

//<lvych00120160912+>
#string STR_MEMORY_INFORMATION                      #language eng "Memory Information"
                                                    #language zh-chs "内存信息"
#string STR_MEMORY_SIZE_STRING                      #language eng "Total Memory"
                                                    #language zh-chs "内存总大小"
#string STR_MEMORY_SIZE_STRING_VALUE                #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_MEMORY_SIZE_VALUE                       #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_MEMORY_FREQUENCY_STRING                 #language eng "Memory Current Speed"
                                                    #language zh-chs "当前内存频率"
#string STR_MEMORY_FREQUENCY_STRING_VALUE           #language eng "N/A"
                                                    #language zh-chs "无"

#string STR_OEM_PROCESSOR_INFORMATION             #language eng "Processor Information"
                                                    #language zh-chs "处理器信息"
#string STR_OEM_PROCESSOR_NAME                    #language eng "Processor Name"
                                                    #language zh-chs "处理器名称"
#string STR_OEM_PROCESSOR_NAME_VALUE              #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_NAME_VALUE2             #language eng ""
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_FAMILY                  #language eng "Processor Family"
                                                    #language zh-chs "处理器类型"
#string STR_OEM_PROCESSOR_FAMILY_VALUE            #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_MODEL                   #language eng "Processor Model"
                                                    #language zh-chs "处理器型号"
#string STR_OEM_PROCESSOR_MODEL_VALUE             #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_STEPPING                #language eng "Processor Stepping"
                                                    #language zh-chs "处理器步进"
#string STR_OEM_PROCESSOR_STEPPING_VALUE          #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_FREQUENCY               #language eng "Processor Frequency"
                                                    #language zh-chs "处理器频率"
#string STR_OEM_PROCESSOR_FREQUENCY_VALUE         #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_MICROCODE               #language eng "Microcode Patch Level"
                                                    #language zh-chs "微码版本"
#string STR_OEM_PROCESSOR_MICROCODE_VALUE         #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_L1_ICACHE               #language eng "L1 Instruction Cache Size"
                                                    #language zh-chs "L1指令 缓存大小"
#string STR_OEM_PROCESSOR_L1_ICACHE_VALUE         #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_L1_DCACHE               #language eng "L1 Data Cache Size"
                                                    #language zh-chs "L1数据 缓存大小"
#string STR_OEM_PROCESSOR_L1_DCACHE_VALUE         #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_L2_CACHE                #language eng "L2 Cache Size"
                                                    #language zh-chs "L2 缓存大小"
#string STR_OEM_PROCESSOR_L2_CACHE_VALUE          #language eng "N/A"
                                                    #language zh-chs "无"
#string STR_OEM_PROCESSOR_L3_CACHE                #language eng "L3 Cache Size"
                                                    #language zh-chs "L3 缓存大小"
#string STR_OEM_PROCESSOR_L3_CACHE_VALUE          #language eng "N/A"
                                                    #language zh-chs "无"

//<zhaoyf-20190617-Add CPU  TDP and XGMI/GMI_FREQUENCY + >
#string STR_PROCESSOR_XGMI_GMI_FREQUENCY            #language eng "XGMI/GMI Frequency"
#string STR_PROCESSOR_XGMI_GMI_FREQUENCY_VALUE      #language eng "N/A"
#string STR_PROCESSOR_GMI_FREQUENCY                 #language eng "GMI Frequency"
#string STR_PROCESSOR_GMI_FREQUENCY_VALUE           #language eng "N/A"
#string STR_PROCESSOR_TDP                           #language eng "Thermal Design Power"
#string STR_PROCESSOR_TDP_VALUE                     #language eng "N/A"
//<zhaoyf-20190617-Add CPU  TDP and XGMI/GMI_FREQUENCY - >

#string STR_SYSTEM_INFORMATION                      #language eng "System Information"
                                                    #language zh-chs "系统信息"
#string STR_BMC_FW_VERSION                          #language eng "BMC FW Revision"
                                                    #language zh-chs "BMC 版本"
#string STR_BMC_FW_VERSION_VALUE                    #language eng "-"
                                                    #language zh-chs "-"
#string STR_SDR_VERSION                             #language eng  "SDR Version"
                                                    #language zh-chs "SDR 版本"
#string STR_SDR_VERSION_HELP                        #language eng  "Version of Sensor Data Records."
                                                    #language zh-chs "传感器数据记录版本"
#string STR_SDR_VERSION_VAL                         #language eng  "-"
                                                    #language zh-chs "-"
#string STR_MODEL_NAME                              #language eng "Model Name"
                                                    #language zh-chs "型号名称"
#string STR_MODEL_NAME_VALUE                        #language eng "-"
                                                    #language zh-chs "-"
#string STR_SYS_MANUFACTURER                        #language eng  "System Manufacturer"
                                                    #language zh-chs "系统制造商"
#string STR_SYS_MANUFACTURER_VAL                    #language eng  "-"
                                                    #language zh-chs "-"
#string STR_SYS_MANUFACTURER_HELP                   #language eng  "System Manufacturer"
                                                    #language zh-chs "系统制造商"
#string STR_SYS_PROD_NAME                           #language eng  "System Product Name"
                                                    #language zh-chs "系统型号"
#string STR_SYS_PROD_NAME_VAL                       #language eng  "-"
                                                    #language zh-chs "-"
#string STR_SYS_PROD_NAME_HELP                      #language eng  "System Product Name"
                                                    #language zh-chs "系统型号"
//<ChengXW001-20170927 Update Smbios Type1 SKU number +>
#string STR_SYS_PROD_NUM                            #language eng  "System Product Number"
                                                    #language zh-chs "系统编号"
#string STR_SYS_PROD_NUM_VAL                        #language eng  "-"
                                                    #language zh-chs "-"
#string STR_SYS_PROD_NUM_HELP                       #language eng  "System Product Number"
                                                    #language zh-chs "系统编号"
//<ChengXW001-20170927 Update Smbios Type1 SKU number ->

#string STR_SYS_SERIAL_NUM                          #language eng  "System Serial Number"
                                                    #language zh-chs "系统序列号"
#string STR_SYS_SERIAL_NUM_VAL                      #language eng  "-"
                                                    #language zh-chs "-"
#string STR_SYS_SERIAL_NUM_HELP                     #language eng  "System Serial Number"
                                                    #language zh-chs "产品序列号"
#string STR_BRD_MANUFACTURER                        #language eng  "Board Manufacturer"
                                                    #language zh-chs "主板制造商"
#string STR_BRD_MANUFACTURER_VAL                    #language eng  "-"
                                                    #language zh-chs "-"
#string STR_BRD_MANUFACTURER_HELP                   #language eng  "Board Manufacturer"
                                                    #language zh-chs "主板制造商"
#string STR_BRD_PROD_NAME                           #language eng  "Board Product Name"
                                                    #language zh-chs "主板名称"
#string STR_BRD_PROD_NAME_VAL                       #language eng  "-"
                                                    #language zh-chs "-"
#string STR_BRD_PROD_NAME_HELP                      #language eng  "Board Product Name"
                                                    #language zh-chs "主板名称"
#string STR_BRD_VERSION                             #language eng  "Board Version"
                                                    #language zh-chs "主板版本"
#string STR_BRD_VERSION_VAL                         #language eng  "-"
                                                    #language zh-chs "-"
#string STR_BRD_VERSION_HELP                        #language eng  "Board Version"
                                                    #language zh-chs "主板版本"
#string STR_BRD_SERIAL_NUM                          #language eng  "Board Serial Number"
                                                    #language zh-chs "主板序列号"
#string STR_BRD_SERIAL_NUM_VAL                      #language eng  "-"
                                                    #language zh-chs "-"
#string STR_BRD_SERIAL_NUM_HELP                     #language eng  "Board Serial Number"
                                                    #language zh-chs "主板序列号"
#string STR_SYSTEM_UUID                             #language eng  "System UUID"
                                                    #language zh-chs "系统 UUID"
#string STR_SYSTEM_UUID_HELP                        #language eng  "System Unique ID."
                                                    #language zh-chs "系统唯一 ID."
#string STR_SYSTEM_UUID_VAL                         #language eng  "-"
                                                    #language zh-chs "-"
//Hugc_20220121_Modify Hotplug address by FRU Setting>>>
#string STR_BRD_EXTRA1_VAL                          #language eng  "-"
                                                    #language zh-chs "-"
#string STR_BRD_EXTRA1                              #language eng  "Board Extra 1"
                                                    #language zh-chs "主板 Extra 1"                                                    
#string STR_BRD_EXTRA1_HELP                         #language eng  "Board Extra 1"
                                                    #language zh-chs "主板 Extra 1"
//Hugc_20220121_Modify Hotplug address by FRU Setting<<<  
//<lvych00120160912->
#string STR_BOARD_INFORMATION               #language eng "Board Information"
                                            #language zh-chs "主板信息"        
#string STR_BOARD_NAME                      #language eng "Board Name"
                                            #language zh-chs "主板名称"       
#string STR_BOARD_NAME_VALUE                #language eng "65N32"
                                            #language zh-chs "65N32"        

#string STR_BOARD_ID_NAME                   #language eng "Board ID"
                                            #language zh-chs "主板 ID"
#string STR_BOARD_ID_NAME_VALUE             #language eng "0"
                                            #language zh-chs "0"
#string STR_BOARD_NAME_EX                   #language eng "Blade Name"
                                            #language zh-chs "叶片名称 "
#string STR_BOARD_NAME_EX_VALUE             #language eng "65N32"
                                            #language zh-chs "65N32"

#string STR_BOARD_ID_NAME_EX                #language eng "Blade ID"
                                            #language zh-chs "叶片 ID"
#string STR_BOARD_ID_NAME_EX_VALUE          #language eng "0"
                                            #language zh-chs "0"
//lubl-e

//Benchmark
#string STR_BENCHMARK_RECOMMENDATION_SETTING	#language en-US "Benchmark Recommendation Setting"
                                                #language zh-chs "基础设置建议"
#string STR_BENCHMARK_RECOMMENDATION_HELP	#language en-US "Benchmark Recommendation Setting"
                                            #language zh-chs "基础设置建议"
#string STR_UNSPECIFIED           		#language en-US "Unspecified"
                                        #language zh-chs "未指定"                                                   
//<Chendl001-20180503 Benchmark Recommendation Setting in AMD Platform +>
//#string STR_SAP_SD_2T_NATIVE           		#language en-US "SAP SD 2T Native"
//#string STR_SPEC_CPU           			#language en-US "SPECcpu"
//#string STR_SPEC_JBB           			#language en-US "SPECjbb"
//#string STR_SPEC_JVM           			#language en-US "SPECjvm"
//#string STR_SPEC_JENTERPRISE           		#language en-US "SPECjEnterprise"
//#string STR_SPEC_POWER           		#language en-US "SPECpower"
//#string STR_SPEC_VIRT           		#language en-US "SPECvirt"
//#string STR_SPEC_COMP           		#language en-US "SPEComp"
//#string STR_SPEC_CMPI           		#language en-US "SPECmpi"
//#string STR_HPC_SUITE           		#language en-US "HPC Suite"
//#string STR_TPC_C           			#language en-US "TPC-C"
//#string STR_TPC_E           			#language en-US "TPC-E"
#string STR_CTM                       #language en-US "Computing Throughput Mode"
                                      #language zh-chs "计算吞吐量模式"
#string STR_CLM                       #language en-US "Computing Latency Mode"
                                      #language zh-chs "计算延迟模式"
#string STR_MNM                       #language en-US "Memory Bandwidth Mode"
                                      #language zh-chs "内存带宽模式"
#string STR_PEM                       #language en-US "Power Efficiency Mode"
                                      #language zh-chs "功率模式"
#string STR_JAM                       #language en-US "Java Application Mode"
                                      #language zh-chs "应用模式"
//<Chendl001-20180503 Benchmark Recommendation Setting in AMD Platform ->
//**********************************************************************
#string STR_STATE_AFTER_G3                      #language en-US "AC Power Loss Policy"
                                                #language zh-chs "交流电源损耗策略"
#string STR_STATE_AFTER_G3_HELP                 #language en-US "Select S0/S5 for ACPI state after a G3"
                                                #language zh-chs "G3之后，选择 S0/S5 为 ACPI状态" 
#string STR_S0_AFTER_G3_STRING                  #language en-US "Always On" 
                                                #language zh-chs  "始终开启" 
#string STR_S5_AFTER_G3_STRING                  #language en-US "Always Off"
                                                #language zh-chs "始终关闭"
#string STR_UNCHANGED_AFTER_G3_STRING           #language en-US "Last State"
                                                #language zh-chs "最终状态"
//**********************************************************************
//<N_Phenix 2016/5/9+>	
#string STR_PASSWORD_NO_OF_RETRIES      #language en-US "Password Retries"
                                        #language zh-chs "密码重试次数"
                                        #language x-UEFI-AMI "PasswordRetries"
#string STR_PASSWORD_NO_OF_RETRIES_HELP      #language en-US "Set Password Retries"
                                             #language zh-chs "设置密码重试的次数"
//**********************************************************************
//<Yaosr001-20181030 add Password Repeats option in the Security interface +>
#string STR_PASSWORD_REPEAT_NUMBERS             #language eng "Password Repeats"
                                                #language zh-chs "密码重复次数"
                                                #language x-UEFI-AMI "PasswordRepeats001"
#string STR_PASSWORD_REPEAT_NUMBERS_HELP        #language eng "Password Repeats(n): the password should be different from the password used in the last n times, the value ranges from 0 to 10."
                                                 #language zh-chs "重复次数n：设置的密码应与最近n次使用过的密码不同，取值范围为0到10"
//<Yaosr001-20181030 add Password Repeats option in the Security interface ->

//<lvych007-20160415 BIOS screen lock function +>
#string STR_SCREEN_LOCK_TIME                    #language en-US "Screen Lock Time"
                                                #language zh-chs "屏幕锁定时间"
                                                #language x-UEFI-AMI "ScreenLockTime"
#string STR_SCREEN_LOCK_TIME_HELP               #language en-US "Set Screen Lock Time."
                                                #language zh-chs "设置屏幕锁定时间"
#string STR_LTIME1                              #language en-US "1 minute"
                                                #language zh-chs "1 分钟"
#string STR_LTIME2                              #language en-US "2 minute"
                                                #language zh-chs "2 分钟"
#string STR_LTIME3                              #language en-US "3 minute"
                                                #language zh-chs "3 分钟"
#string STR_LTIME4                              #language en-US "4 minute"
                                                #language zh-chs "4 分钟"
#string STR_LTIME5                              #language en-US "5 minute"
                                                #language zh-chs "5 分钟"
#string STR_LTIME6                              #language en-US "10 minute"
                                                #language zh-chs "10 分钟"
#string STR_LTIME7                              #language en-US "15 minute"
                                                #language zh-chs "15 分钟"
#string STR_LTIME8                              #language en-US "20 minute"
                                                #language zh-chs "20 分钟"
#string STR_LTIME9                              #language en-US "25 minute"
                                                #language zh-chs "25 分钟"
#string STR_LTIME10                             #language en-US "30 minute"
                                                #language zh-chs "30 分钟"
#string STR_LTIME11                             #language en-US "45 minute"
                                                #language zh-chs "45 分钟"
#string STR_LTIME12                             #language en-US "1 hour"
                                                #language zh-chs "1 小时"
#string STR_LTIME13                             #language en-US "2 hour"
                                                #language zh-chs "2 小时"
#string STR_LTIME14                             #language en-US "3 hour"
                                                #language zh-chs "3 小时"
#string STR_LTIME15                             #language en-US "4 hour"
                                                #language zh-chs "4 小时"
#string STR_LTIME16                             #language en-US "5 hour"
                                                #language zh-chs "5 小时"
//<lvych007-20160415 BIOS screen lock function ->

//<lvych00120160810+>
#string STR_ADMIN_PASSWORD_VALUE      #language en-US "Not Installed"
                                      #language zh-chs "未安装"
#string STR_USER_PASSWORD_VALUE      #language en-US "Not Installed"
                                     #language zh-chs "未安装"
//<lvych00120160810->
//<xuyj1-20180903 Add a switch for the built in uefi shell boot option+ >
#string STR_OEM_UEFIShellDisable                           #language eng  "Boot To UEFI Shell"
                                                             #language zh-chs "UEFI Shell"
#string STR_OEM_UEFIShellDisable_HELP                      #language eng  "Select boot to uefi shell or not"
                                                             #language zh-chs "是否支持UEFI Shell启动"
//<xuyj1-20180903 Add a switch for the built in uefi shell boot option- >
//<xuyj1-20180829-add password complex select+>
#string STR_SELECT_PASSWORD_TYPE                #language eng "Password Type" 
#string STR_SELECT_PASSWORD_TYPE_HELP           #language eng "Select to set simple or complex password"
#string STR_SIMPLE_PASSWORD                     #language eng "Simple"
#string STR_COMPLEX_PASSWORD                    #language eng "Complex"
#string STR_ERROR_SIMPLE_INPUT                  #language eng "Invalid Input Simple"
//<xuyj1-20180829-add password complex select->

//<huangjin003-20190423 Translate some setup items into Chinese +>
#string STR_SMART_FORM              #language eng "SMART Settings"
                                    #language zh-chs "SMART 设置"
#string STR_SMART_FORM_HELP         #language eng "System SMART Settings"
                                    #language zh-chs "系统SMART 设置"
#string STR_SMART_SELFTEST          #language eng "SMART Self Test"
                                    #language x-UEFI-AMI "SMARTSelfTest"
                                    #language zh-chs "SMART 自检"
#string STR_SMART_SELFTEST_HELP     #language eng "Run SMART Self Test on all HDDs during POST."
                                    #language zh-chs "POST期间在所有的硬盘上运行SMART 自检." 
                                    
#string STR_AST2500_SIO_FORM                        #language eng "AST2500 Super IO Configuration"
                                                    #language zh-chs "AST2500超级IO管理"
#string STR_AST2500_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
                                                    #language zh-chs "系统超级IO芯片参数"

#string AMISETUPNVLOCK_CONTROL_FORM         #language en-US "AmiSetupNvlock"                                 
#string AMISETUPNVLOCK_CONTROL_FORM_HELP    #language en-US " AmiSetupNvlock Settings"   
                                            #language zh-chs " AmiSetupNvlock设置"                                  
#string STR_NVLOCK_FV_LOAD_SUPPORT          #language en-US "RunTimeVariable Protection Support"
                                            #language zh-chs "RunTimeVariable保护支持"
#string STR_NVLOCK_FV_LOAD_SUPPORT_HELP     #language en-US "Enable/Disable the RunTimeVariable Protection Support" 
                                            #language zh-chs "打开/关闭RunTimeVariable保护支持"                            
//<huangjin003-20190423 Translate setup some items into Chinese ->
#string STR_ACS_CONTROL_POLICY                               #language eng "ACS Control"
#string STR_ACS_CONTROL_POLICY                               #language zh-chs "ACS 控制"
#string STR_ACS_CONTROL_POLICY_HELP                          #language eng "Enabled,for each PCI express switch downstream ports, enable the required Capabilities in ACS control register"
#string STR_ACS_CONTROL_POLICY_HELP                          #language zh-chs "访问控制服务（Access Control Services，ACS），当启用时，对于所有的PCIe 转换器下行口, 启用ACS 控制寄存器里要求的性能"

//<Lvshh001-20200905 Add Reserve bus for SRIOV device function +>
#string STR_RESERVE_BUS_FOR_SRIOV                            #language eng "Reserve Bus For SRIOV"
                                                             #language zh-chs "给SRIOV设备预留 BUS号"
#string STR_RESERVE_BUS_FOR_SRIOV_HELP                       #language eng "Reserve Bus For SRIOV Device"
                                                             #language zh-chs "给SRIOV设备预留 BUS号"
//<Lvshh001-20200905 Add Reserve bus for SRIOV device function ->

//<duanjun 20200514 mantis0039358 bios password chinese languare string show error+>
#string STR_PASSWORD_VALUE_INSTALLED  #language en-US "Installed"
                                      #language zh-chs "安装"
                                      
#string STR_PASSWORD_VALUE_NOT_INSTALLED  #language en-US "Not Installed"
                                          #language zh-chs "未安装 "
//<duanjun 20200514 mantis0039358 bios password chinese languare string show error->

//<Yaosr001-20190731 Support BIOS HotKey select. +>
#string STR_BIOS_HOTKEY_SUPPORT                 #language  eng    "BIOS HotKey Support"
                                                #language  zh-chs "BIOS热键支持"
                                                #language  x-UEFI-AMI  "BIOSHotKeySupport"
#string STR_BIOS_HOTKEY_SUPPORT_HELP            #language  eng    "Enabled/Disabled Support HotKey to Enter Setup."
                                                #language  zh-chs "启用/禁用支持热键进入BIOS Setup"
//<Yaosr001-20190731 Support BIOS HotKey select. ->

//<Yaosr001-20200707 Add BIOS option to control bios password lock time. +>
#string STR_PASSWORD_LOCK_TIME                   #language  eng    "Password Lock time"
                                                 #language  x-UEFI-AMI  "PasswordLocktime"
                                                 #language  zh-chs "密码锁定时间"
#string STR_PASSWORD_LOCK_TIME_HELP              #language  eng    "Set Password Lock time, the default value is 3 minutes, and the option value from 1 to 255 minutes."
                                                 #language  zh-chs "设置密码锁定时间，默认值为3分钟，取值为1~255分钟。"
//<Yaosr001-20200707 Add BIOS option to control bios password lock time. ->

//<YinQiang001-20191202-Add password length and validity select +>
#string STR_ERROR_LENGTH_INPUT                  #language eng "Invalid Input Password Length"
                                                #language zh-chs "密码长度不符合要求"
#string STR_ERROR_MIN_MAX_LENGTH_INPUT          #language eng "Error. Min Length > Max Length"
                                                #language zh-chs "错误，设置的最小长度大于最大长度"
#string STR_SELECT_PASSWORD_LENGTH_MIN          #language eng "Password Shortest Length"
                                                #language zh-chs "最短密码长度"
#string STR_SELECT_PASSWORD_LENGTH_MIN_HELP     #language eng "Password Shortest Length.The minimum value is 1 and the maximum value is 20"
                                                #language zh-chs "最短密码长度"
#string STR_SELECT_PASSWORD_LENGTH_MAX          #language eng "Password Longest Length"
                                                #language zh-chs "最长密码长度"
#string STR_SELECT_PASSWORD_LENGTH_MAX_HELP     #language eng "Password Longest Length.The minimum value is 1 and the maximum value is 20"
                                                #language zh-chs "最长密码长度"
#string STR_SELECT_PASSWORD_VALIDITY            #language eng "Password Validity"
                                                #language zh-chs "密码有效期"
#string STR_SELECT_PASSWORD_VALIDITY_HELP       #language eng "Set remaining password validity time.Unit is day.When value is 0, it is always valid"
                                                #language zh-chs "设置密码有效期，以天为单位。当值为零时，永久有效。"
#string STR_SELECT_PASSWORD_PROMPT_PERIOD       #language eng "Password Prompt Period"
                                                #language zh-chs "密码提示期"
#string STR_SELECT_PASSWORD_PROMPT_PERIOD_HELP  #language eng "Set time to remind password remaining time.Unit is day"
                                                #language zh-chs "设置密码有效期剩余时间,以天为单位。"
//<YinQiang001-20191202-Add password length and validity select ->
//<Machong-20170405-For HDD Frozen switch+>
//<Luy001-20191025 Change Setup Item Name per Beiji spec v0.87 +>
//#string STR_FROZEN_LOCK_SWITCH      #language en-US "HDD Frozen"
#string STR_FROZEN_LOCK_SWITCH      #language en-US "SECURITY FREEZE LOCK" 
                                    #language x-UEFI-AMI "FREEZELOCK001"
//<Luy001-20191025 Change Setup Item Name per Beiji spec v0.87 ->
#string STR_FROZEN_LOCK_HELP        #language en-US "Enable or Disable HDD Frozen Feature"
//<Machong-20170405-For HDD Frozen switch->
